function Information() {
  return (
    <section className="information">
      <h2 className="information__title">НАШИ УСЛУГИ</h2>
      <p className="information__subtitle">
        Украсьте свой автомобиль или любую другую поверхность с помощью
        профессиональной аэрографии от нашей команды! Более 5 лет мы создаем
        настоящие произведения искусства на заказ с использованием
        высококачественных материалов и оборудования.
      </p>
      <p className="information__subtitle">
        Аэрография придаст вашему авто или мотоциклу уникальный стильный вид. Мы
        расписываем любые поверхности - от капота до колесных дисков.
        Воспользуйтесь нашими услугами, чтобы выделиться из потока!
      </p>
      <p className="information__subtitle">
        Закажите аэрографию для интерьера - и любое помещение преобразится до
        неузнаваемости. Создадим для вас настоящий шедевр! Работаем с частными
        клиентами и организациями. Гарантия 1 год. Звоните прямо сейчас!
      </p>
    </section>
  );
}

export default Information;
