function Information() {
  return (
    <section className="information">
      <h2 className="information__title">НАШИ УСЛУГИ</h2>
      <p className="information__subtitle">
        Множество компаний оказывает услуги по нанесению аэрографии на авто в
        Москве, но не всем под силу справиться со сложными и нестандартными
        задачами. Наши художники обладают огромным опытом и применяют в работе
        только современное высокотехнологичное оборудование, которое позволяет
        добиваться идеальной точности, яркости и долговечности. Технология
        аэрографии позволяет создавать по-настоящему реалистичные изображения с
        помощью последовательного нанесения множества слоёв краски, добиваясь
        наилучшей детализации и безупречной цветопередачи. Такое мастерство
        предполагает нанесение рисунка с использованием аэрографа — небольшого
        пульверизатора с жидкой краской. Сделав заказ аэрографии на машину в
        нашей мастерской, вы гарантированно получите превосходное качество по
        доступной цене.
      </p>
    </section>
  );
}

export default Information;
