import { useLocation } from "react-router-dom";

function AboutAirbrushing() {
  const location = useLocation();

  if (location.pathname === '/car') {
    return (
      <section className="about-airbrushing">
        <h2 className="about-airbrushing__title">ЦЕНЫ НА АЭРОГРАФИЮ МАШИНЫ</h2>
        <p className="about-airbrushing__subtitle">
          Аэрография — незаменимый инструмент для создания поистине уникального и
          стильного внешнего облика вашего мотоцикла. Профессиональные мастера
          нашей студии способны нанести на различные элементы вашего байка
          практически любое яркое цветное изображение, рисунок или композицию при
          помощи аэрографической техники.
        </p>
        <p className="about-airbrushing__subtitle">
          Использование аэрографии позволит создать из вашего обычного мотоцикла
          настоящее чудо в мире искусства, привлекающее изумленные взгляды на
          дороге. Мы с радостью украсим бак, раму, обтекатели, диски колес и
          другие части вашего мотоцикла в любом стиле – от классики до авангарда.
        </p>
        <p className="about-airbrushing__subtitle">
          Если вам хочется придать вашему байку поистине эксклюзивный внешний вид
          и выделиться среди других мотоциклистов, воспользуйтесь услугами нашей
          профессиональной аэрографической студии!
        </p>
      </section>
    );
  }

  if (location.pathname === '/motorcycle') {
    return (
      <section className="about-airbrushing">
        <h2 className="about-airbrushing__title">ЦЕНЫ НА АЭРОГРАФИЮ МОТОЦИКЛА</h2>
        <p className="about-airbrushing__subtitle">
          Аэрография — незаменимый инструмент для создания поистине уникального и
          стильного внешнего облика вашего мотоцикла. Профессиональные мастера
          нашей студии способны нанести на различные элементы вашего байка
          практически любое яркое цветное изображение, рисунок или композицию при
          помощи аэрографической техники.
        </p>
        <p className="about-airbrushing__subtitle">
          Использование аэрографии позволит создать из вашего обычного мотоцикла
          настоящее чудо в мире искусства, привлекающее изумленные взгляды на
          дороге. Мы с радостью украсим бак, раму, обтекатели, диски колес и
          другие части вашего мотоцикла в любом стиле – от классики до авангарда.
        </p>
        <p className="about-airbrushing__subtitle">
          Если вам хочется придать вашему байку поистине эксклюзивный внешний вид
          и выделиться среди других мотоциклистов, воспользуйтесь услугами нашей
          профессиональной аэрографической студии!
        </p>
      </section>
    );
  }

   if (location.pathname === '/laptop') {
    return (
      <section className="about-airbrushing">
        <h2 className="about-airbrushing__title">ЦЕНЫ НА АЭРОГРАФИЮ НОУТБУКА</h2>
        <p className="about-airbrushing__subtitle">
          Аэрография — незаменимый инструмент для создания поистине уникального и
          стильного внешнего облика вашего мотоцикла. Профессиональные мастера
          нашей студии способны нанести на различные элементы вашего байка
          практически любое яркое цветное изображение, рисунок или композицию при
          помощи аэрографической техники.
        </p>
        <p className="about-airbrushing__subtitle">
          Использование аэрографии позволит создать из вашего обычного мотоцикла
          настоящее чудо в мире искусства, привлекающее изумленные взгляды на
          дороге. Мы с радостью украсим бак, раму, обтекатели, диски колес и
          другие части вашего мотоцикла в любом стиле – от классики до авангарда.
        </p>
        <p className="about-airbrushing__subtitle">
          Если вам хочется придать вашему байку поистине эксклюзивный внешний вид
          и выделиться среди других мотоциклистов, воспользуйтесь услугами нашей
          профессиональной аэрографической студии!
        </p>
      </section>
    );
  }

  if (location.pathname === '/helmet') {
    return (
      <section className="about-airbrushing">
        <h2 className="about-airbrushing__title">ЦЕНЫ НА АЭРОГРАФИЮ ШЛЕМА</h2>
        <p className="about-airbrushing__subtitle">
          Аэрография — незаменимый инструмент для создания поистине уникального и
          стильного внешнего облика вашего мотоцикла. Профессиональные мастера
          нашей студии способны нанести на различные элементы вашего байка
          практически любое яркое цветное изображение, рисунок или композицию при
          помощи аэрографической техники.
        </p>
        <p className="about-airbrushing__subtitle">
          Использование аэрографии позволит создать из вашего обычного мотоцикла
          настоящее чудо в мире искусства, привлекающее изумленные взгляды на
          дороге. Мы с радостью украсим бак, раму, обтекатели, диски колес и
          другие части вашего мотоцикла в любом стиле – от классики до авангарда.
        </p>
        <p className="about-airbrushing__subtitle">
          Если вам хочется придать вашему байку поистине эксклюзивный внешний вид
          и выделиться среди других мотоциклистов, воспользуйтесь услугами нашей
          профессиональной аэрографической студии!
        </p>
      </section>
    );
  }

  if (location.pathname === '/bike') {
    return (
      <section className="about-airbrushing">
        <h2 className="about-airbrushing__title">ЦЕНЫ НА АЭРОГРАФИЮ ВЕЛОСИПЕДА</h2>
        <p className="about-airbrushing__subtitle">
          Аэрография — незаменимый инструмент для создания поистине уникального и
          стильного внешнего облика вашего мотоцикла. Профессиональные мастера
          нашей студии способны нанести на различные элементы вашего байка
          практически любое яркое цветное изображение, рисунок или композицию при
          помощи аэрографической техники.
        </p>
        <p className="about-airbrushing__subtitle">
          Использование аэрографии позволит создать из вашего обычного мотоцикла
          настоящее чудо в мире искусства, привлекающее изумленные взгляды на
          дороге. Мы с радостью украсим бак, раму, обтекатели, диски колес и
          другие части вашего мотоцикла в любом стиле – от классики до авангарда.
        </p>
        <p className="about-airbrushing__subtitle">
          Если вам хочется придать вашему байку поистине эксклюзивный внешний вид
          и выделиться среди других мотоциклистов, воспользуйтесь услугами нашей
          профессиональной аэрографической студии!
        </p>
      </section>
    );
  }

  if (location.pathname === '/house') {
    return (
      <section className="about-airbrushing">
        <h2 className="about-airbrushing__title">ЦЕНЫ НА АЭРОГРАФИЮ ЗДАНИЧЯ</h2>
        <p className="about-airbrushing__subtitle">
          Аэрография — незаменимый инструмент для создания поистине уникального и
          стильного внешнего облика вашего мотоцикла. Профессиональные мастера
          нашей студии способны нанести на различные элементы вашего байка
          практически любое яркое цветное изображение, рисунок или композицию при
          помощи аэрографической техники.
        </p>
        <p className="about-airbrushing__subtitle">
          Использование аэрографии позволит создать из вашего обычного мотоцикла
          настоящее чудо в мире искусства, привлекающее изумленные взгляды на
          дороге. Мы с радостью украсим бак, раму, обтекатели, диски колес и
          другие части вашего мотоцикла в любом стиле – от классики до авангарда.
        </p>
        <p className="about-airbrushing__subtitle">
          Если вам хочется придать вашему байку поистине эксклюзивный внешний вид
          и выделиться среди других мотоциклистов, воспользуйтесь услугами нашей
          профессиональной аэрографической студии!
        </p>
      </section>
    );
  }

}

export default AboutAirbrushing;
